package com.ahern.livinghelper.recreation.constellation.model;

import java.util.List;

/**
 * @auther: WangHao on 2017/9/8 10:18
 * @email：Ahern.h.wang@emore-smart.com
 */

public class DreamRequestListEntity {

    /**
     * reason : successed
     * result : [{"id":"913d226b18ff44fda2fdc8ec1d3851c1","title":"蛇","des":"蛇在梦中出现是典型的具有性意味的意象，梦见蛇可能暗示你对性的感觉或是性生活的状态。也许你最近有些欲求不满;也许性行为让你充满罪恶感，甚至感觉污秽;也可能你的性生活很美满，让你乐在其中。不同的梦境中，蛇给不同的做梦者带来不同的心理感觉。"},{"id":"91d213d8909c839d84f74079e2fb84d5","title":"大蛇","des":"梦见大蛇能发大财。"},{"id":"be69cdb54ef87c45ebb53657e41a8dda","title":"蟒蛇","des":"梦中的蟒蛇，代表着困难和障碍，另外也暗示着梦者可能会受到其他爬行动物的伤害，要多加防范。"},{"id":"3307bd254961eca991c458f9ec875077","title":"一群蛇","des":"梦见群蛇呆在家中，会财源不断。"},{"id":"d76dec79975b2f74cdb2ae3746508606","title":"大蟒蛇","des":"梦见大蟒蛇，它表示多风多雨的时期，以及糟糕的运气，但随之人性会复苏。"},{"id":"433264de0873bac920fe348e32a96994","title":"抓蛇","des":"一般蛇在梦中出现多数是男性性器官的象征。或有性的愿望，表示性能力强。同时它也反映了你不安的心理，事实上是潜意识对性的恐惧。这个梦也是代表对追求爱情的表现或是散发性愿望。"},{"id":"7598b2e982248a5bcd987925a1682d84","title":"毒蛇","des":"梦见毒蛇说明生活上某些事情正处于危境，要小心处理对待。"},{"id":"5b5d9cea70d4f3e81a4834f1eb253baf","title":"白蛇","des":"梦见白蛇，吉兆，是发财的预兆。"},{"id":"a43a2f150298ec0ac6393e5ab5a8e500","title":"很多蛇","des":"梦见很多蛇，说明目前你被某些欲望纠缠，你的理性曾经企图摆脱这些欲望，但是你的情感却在说服接受它们。"},{"id":"2b255c38efbcf6476eb0aebb428eb426","title":"好多蛇","des":"梦见好多蛇，在爱情方面有阴影。你的缺点将使对方厌烦。应该趁着这个机会，把自己的缺点加以改正，来一次性格转变吧。"},{"id":"d04148a6e3bd37598fa66e3ab9579b72","title":"一对蛇 两条蛇","des":"成年男子梦见一对蛇，预示很快会分家。"},{"id":"35a7e1fe500ac8067c40ac155b40e803","title":"小蛇","des":"梦见小蛇财务运势不是很好，目前仍有许多待解决的问题与压力，不宜大举扩充。"},{"id":"52fdb04b7282b81112ea72ab7cde5341","title":"绿蛇","des":"梦见绿蛇，不祥之兆，会有坏消息传来。"},{"id":"632d3e25be20de79f0dcafe4070aac65","title":"黑蛇 大黑蛇","des":"梦见黑蛇，主口舌，就是有小人在你背后诽谤你。"},{"id":"32a9c8f48b575c980dae01fb45ddeed8","title":"黄蛇","des":"文公梦黄蛇自天下属地，其口止于鄜衍。文公问史敦，敦曰：此上帝之征，君其祠之。"},{"id":"b376c2564f90e3d5c15c74bd9e57aecd","title":"死蛇","des":"梦见死蛇，吉兆，会有好运。"},{"id":"c20e72476299da5c33113cb01f4cf2b9","title":"红蛇","des":"梦见红蛇，会有喜事发生。"},{"id":"df522fb2e4e1d7e6e519271ab765f758","title":"青蛇","des":"梦见青蛇咬手，吉兆，生活会无忧无虑。"},{"id":"dfae2a3ce47164f0482896701d956d83","title":"花蛇","des":"梦见花蛇，预示主人会交挑花运。"},{"id":"8b5f4d45ac8ae6ab33733750ce180c04","title":"眼镜蛇","des":"学生梦见眼镜蛇，预示着学业有成，生意红火，工作上的进展和生活水平的改善。"},{"id":"b29ff02455ce1b81f4b7e3c9d737036f","title":"水蛇","des":"周公解梦认为：梦见水蛇，吉照；水为财，蛇为龙，有贵人相助。"},{"id":"811fb172c9b43ff323ce15400013095a","title":"金蛇","des":"金蛇是家里的财神。"},{"id":"b4282e138ca434282de0df0264b5bccf","title":"蛇头","des":"梦见蛇头：意味着得病受穷。"},{"id":"0c275779912cc71c4ea87b6f003ba5aa","title":"小毒蛇","des":"梦中见到一条小毒蛇和一个朋友，梦中朋友看起来像死了一样，躺倒在地上，均匀地呼吸着，将要坐直时，小毒蛇突然咬了他，然后小毒蛇和朋友消失在灌木丛中。这个梦预示着你朋友的命运不好，将让你十分悲伤，而且你自己也将面临损失。"},{"id":"3b7db6a3b30930615b04f6d4385d4c6d","title":"无头蛇","des":"梦见无头蛇，不吉。最近要注意出行安全及财产损失。还有就是注意身体健康问题。"},{"id":"ba28d7a67834e6746098ed7284ce2879","title":"蛇吃青蛙","des":"梦见蛇吃青蛙，有两种说法，一种是会有财运，另一种会与人发生口角。"},{"id":"41551709b52332c4408fe609bb7d1919","title":"蝮蛇","des":"女性梦到蝮蛇，预示有个伪善的家伙将要骚扰她。"},{"id":"1539b1ac7dd2726153859c9e13e606b4","title":"龟蛇","des":"梦见龟与蛇互相对峙，表示财源滚进。"},{"id":"fe91dd600e84fa132b77cadbf1a132fb","title":"杀蛇","des":"梦见杀蛇是吉兆，预示着将会排除困难，一切顺利。"},{"id":"0c326d593e2da25d7ad36de5b64a47f3","title":"蛇咬人","des":"梦见蛇咬人，是运势转好之预兆。"},{"id":"65073b9318d237a40740c8d973cb5f1a","title":"被蛇咬","des":"梦见蛇咬你自己，要交好运，生活会丰裕。"},{"id":"002026b82b2009b322c6ab75a677ab16","title":"打蛇","des":"梦见打死蛇，能征服敌人。"},{"id":"f9507b52987ae6590f5c35efae135c3a","title":"蛇咬我","des":"心理学上说蛇的意象是男性，梦见蛇咬你，可能是你遇到一种困扰，也许由于你的一个重要的异性朋友，向你提出一种要求，就像是他想进一步发展你们的关系(男女间的亲密关系)，但你的心理好像还没做好准备，你在犹豫，但他已进开始了，并对你一直引导，这时你的心中可能已经做好了决定要进一步发展，于是梦中蛇就咬你了了。"},{"id":"6e6d23a52b5ff135f73fe6aa0de779a0","title":"打死蛇","des":"梦见打死蛇，能征服敌人。"},{"id":"9e130c3afbd7a75b767ce30c18726396","title":"被蛇追","des":"梦见被蛇追赶，不祥之兆，会有债主上门讨债。"},{"id":"c177530c057ed57fd60e7bd3a95b27ea","title":"捉蛇","des":"梦见捉蛇，因为食欲好而大吃特吃结果身体发福，原来的衣服不能穿。"},{"id":"530c9a2a8c4d6d6fdab2e352c92a0e07","title":"打蛇不死","des":"梦见打蛇不死，一般是身体虚弱，肾虚的原因，在不就是想要生病的前兆。"},{"id":"33d84c1bcf1f35296ffa61ec97688198","title":"吃蛇肉","des":"梦见吃蛇肉，吉兆，能征服敌人。"},{"id":"024a29617efb2800ea14a6d2b975e277","title":"吃蛇","des":"梦见吃蛇，此梦中蛇还代表邪恶、狡诈、冷血、欺骗以及诱惑，这与许多神话和民间传说中的蛇的形象相同。蛇往往被看成地狱中的动物或者魔鬼使者，它把人拖向黑暗、堕落和邪恶，而它采用的手段主要是诱惑。民间传说，蛇吃青蛙不是主动捕捉，一旦蛇发现青蛙，就用眼睛盯着它，而这时的青蛙就像被催眠了一样，会一步步自己跳进蛇的嘴里。在人们心目中，蛇正代表了这样一种催眠性的诱惑力量。因此当人们发现某个人有诱惑力且很邪恶，称之为毒蛇；如果这个诱惑者是个女人，那些我们就称之美女蛇、蛇蝎美人或者说这女人是毒蛇。"},{"id":"ee3ccb49aff994cd1424436913a614ec","title":"蛇妖","des":"梦见蛇妖，人头蛇身的妖怪向我走来，表示有一个虚伪的家伙在靠近你，不久将会露出她的真面目。"},{"id":"cec5fa9fd9868bec05a2e66800d959ab","title":"龙蛇","des":"梦见龙蛇进入家里，预示着会发财。"},{"id":"434d6109e175b75447b1679043123bb2","title":"蛇缠身","des":"通常做梦梦见蛇缠身，预示梦者会有麻烦事发生。"},{"id":"75b7598552b4e8e57809b36beec9efd7","title":"蛇杖","des":"蛇杖是被医生和医药机构用作治愈疾病的标志。梦中见到蛇杖，表示提醒注意健康事务一一或者是自身的健康，或者是关心其他亲戚朋友的健康。"}]
     * error_code : 0
     */

    private String reason;
    private int error_code;
    private List<DreamBriefEntity> result;

    public String getReason() {
        return reason;
    }

    public void setReason(String reason) {
        this.reason = reason;
    }

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public List<DreamBriefEntity> getResult() {
        return result;
    }

    public void setResult(List<DreamBriefEntity> result) {
        this.result = result;
    }


}
